//9

let s1 = prompt();//prompt() ֆունկցիան բացում է վինդոու, որտեղ օգտվողը կարող է ինչ-որ տեքստ գրել:Օգտվողի գրած տեքստը պահվում է s1 փոփոխականի մեջ:

if (s1.includes('ABC')) {//includes մեթոդը ստուգում է, արդյոք տեքստում կա 'ABC' ենթատողը:
    s1 = s1.replace(/\d/g, '*');  // Փոխարինում ենք բոլոր թվերը * : \d նշանակում է ցանկացած թիվ:g դրոշմը (flag) նշանակում է "global", այսինքն՝ փոխարինել բոլոր թվերը տեքստում, ոչ միայն առաջինը
    s1 = s1.toUpperCase();        // Փոխարկում ենք փոքրատառերի
} else {
    s1 = s1.replaceAll(',', ' , ');
}

alert(s1);  // Ցույց է տալիս փոփոխված տեքստը